{
  "Experience": "Doświadczenie",
  "Senior Software Enginner": "Starszy Inżynier Oprogramowania",
  "Software Enginner": "Inżynier Oprogramowania",
  "Junior Software Engineer": "Młodszy Inżynier Oprogramowania",
  "I am a passionate and dedicated software engineer with a love for problem-solving and technology. With a strong foundation in computer science, I have honed my skills in various programming languages and frameworks. I thrive in a team environment and am always eager to learn new skills and technologies to create innovative solutions. I believe in the power of technology to make a positive impact on society and strive to contribute to this through my work.": "Jestem pełnym pasji i zaangażowanym inżynierem oprogramowania z miłością do rozwiązywania problemów i technologii. Dzięki mocnym podstawom w informatyce, doskonaliłem swoje umiejętności w różnych językach programowania i frameworkach. Dobrze czuję się w zespole i zawsze jestem chętny do nauki nowych umiejętności i technologii, aby tworzyć innowacyjne rozwiązania. Wierzę w moc technologii, aby wpływać pozytywnie na społeczeństwo i dążę do przyczyniania się do tego poprzez swoją pracę.",
  "Contact": "Kontakt",
  "NAME": "IMIĘ",
  "MESSAGE": "WIADOMOŚĆ",
  "Interests": "Zainteresowania",
  "Education": "Edukacja",
  "January 2016": "Styczeń 2016",
  "December 2018": "Grudzień 2018",
  "January 2019": "Styczeń 2019",
  "December 2021": "Grudzień 2021",
  "January 2022": "Styczeń 2022",
  "Present": "Obecnie",
  "Worked on developing and maintaining client-side applications. Collaborated with the team to design innovative solutions for our clients.":"Pracowałem nad tworzeniem i utrzymaniem aplikacji po stronie klienta. Współpracowałem z zespołem nad projektowaniem innowacyjnych rozwiązań dla naszych klientów.",
  "Led a team of junior developers to build robust server-side applications. Implemented agile methodologies to improve the development process.":"Prowadziłem zespół młodszych programistów do tworzenia solidnych aplikacji po stronie serwera. Wdrożyłem metodyki zwinne, aby usprawnić proces tworzenia oprogramowania.",
  "Overseeing the design and development of software applications. Driving the adoption of best practices in code health, testing, and maintainability.":"Nadzorowanie projektowania i tworzenia aplikacji oprogramowania. Promowanie stosowania najlepszych praktyk w zakresie zdrowia kodu, testowania i utrzymania.",
  "Astronomy": "Astronomia",
  "Coding": "Programowanie",
  "Photography": "Fotografia",
  "The study of celestial objects, space, and the physical universe as a whole. It involves observing the night sky and learning about the stars, planets, and galaxies.":"Studium obiektów niebieskich, przestrzeni i całego wszechświata. Polega na obserwacji nocnego nieba i uczeniu się o gwiazdach, planetach i galaktykach.",
  "The process of designing and building an executable computer program to accomplish a specific computing result or to perform a specific task.":"Proces projektowania i budowania wykonywalnego programu komputerowego, aby osiągnąć określony wynik obliczeniowy lub wykonać określone zadanie.",
  "The art, application, and practice of creating durable images by recording light, either electronically by means of an image sensor, or chemically by means of a light-sensitive material such as photographic film.":"Sztuka, zastosowanie i praktyka tworzenia trwałych obrazów poprzez rejestrowanie światła, zarówno elektronicznie za pomocą czujnika obrazu, jak i chemicznie za pomocą materiału światłoczułego, takiego jak film fotograficzny.",
  "SEND": "WYŚLIJ",
  "High School Diploma": "Dyplom ukończenia szkoły średniej",
  "Bachelor of Science in Computer Science": "Licencjat Informatyki",
  "Master of Science in Software Engineering": "Magister Inżynierii Oprogramowania",
  "Completed high school with a strong foundation in mathematics and science.": "Ukończyłem szkołę średnią z mocnymi podstawami matematyki i nauk ścisłych.",
  "Studied various aspects of computer science including algorithms, data structures, software design, and computer architecture.": "Studiowałem różne aspekty informatyki, w tym algorytmy, struktury danych, projektowanie oprogramowania i architekturę komputerów.",
  "Specialized in software engineering with a focus on software development, project management, and quality assurance.": "Specjalizowałem się w inżynierii oprogramowania, skupiając się na tworzeniu oprogramowania, zarządzaniu projektami i zapewnianiu jakości.",
  "September 2010": "Wrzesień 2010",
  "June 2014": "Czerwiec 2014",
  "September 2014": "Wrzesień 2014",
  "June 2018": "Czerwiec 2018",
  "September 2018": "Wrzesień 2018",
  "June 2020": "Czerwiec 2020"
}